import React from "react";
import NavBar from "@/components/NavBar";

class Protocol extends React.Component {
  render() {
    return (
      <div>
        <NavBar />
        <div
          style={{
            width: "800px",
            margin: '0 auto',
            backgroundColor: "#fff",
            padding: "10px",
            fontWeight: "bold"
          }}
        >
          用户服务协议 <br />
          【特别提示】
          <br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;如您同意成为的用户或使用的服务的，请您务必仔细阅读、充分理解以下《用户服务协议》及《隐私权政策》中的各项条款，尤其是协议中的以粗体方式或加下划线的方式提示您重点注意。
          用户服务协议 欢迎您使用的服务！
          为使用的服务，您应当阅读并遵守本《用户服务协议》（以下简称“本协议”）。本协议是用户与之间的法律协议，是用户注册账号并使用平台服务或非经注册程序直接使用平台服务时的通用条款。请您务必审慎阅读、充分理解本协议各条款内容，特别是免除或者限制责任的条款、管辖与法律适用条款。限制、免责条款可能以黑体加粗或加下划线的形式提示您重点注意。如果您不同意本协议的约定，您应立即停止注册程序或停止使用平台服务；如您继续访问和使用平台服务，即视为您已确知并完全同意本协议各项约定。
          一、定义
          1、平台，是指上海瑞家信息技术有限公司旗下运营之网站（www.anjuke.com)、无线站点（包括wap.anjuke.com,m.anjuke.com）及移动应用软件（APP），平台系专注于房地产行业为用户提供房产信息存储空间及网络推广服务的互联网平台。
          2、用户，以下亦称为“您”，系指注册或登录平台使用产品或服务的具有完全民事权利能力和行为能力的企业法人、社会团体、自然人或其他社会组织等。按用户是否经过注册程序分为注册用户和非注册用户，注册用户是指通过平台完成全部注册程序后，使用平台服务或网站资料的用户。非注册用户是指未进行注册、直接登录平台或通过其他平台允许的方式进入平台直接或间接地使用平台服务或网站资料的用户。按用户使用服务的方式分为开发商用户、经纪人用户以及其他普通消费者用户，其中开发商用户及经纪人用户可能会使用另行提供的后台系统。
          3、协议方，本协议中协议双方合称“协议方”。上海瑞家信息技术有限公司及其相关服务可能存在的运营关联单位、平台在协议中统称为""。
          二、协议的效力
          1、在您按照注册页面提示填写信息、阅读并同意本协议并完成全部注册程序后或以其他允许的方式实际使用平台服务时，您即受本协议的约束。
          2、本协议内容包括本协议正文，您在使用某一特定服务或系统时，该服务可能会另有单独的协议、相关业务规则、公告、帮助、说明、通用条款等（以下统称为“规则”）。所有已经发布的或将来可能发布的规则均为本协议不可分割的组成部分，与本协议具有同等法律效力。除另行明确声明外，任何及其关联公司提供的服务（以下称为“平台服务”）均受本协议约束。您承诺接受并遵守本协议的约定。如果您不同意本协议的约定，您应立即停止注册程序或停止使用平台服务；如您继续访问和使用平台服务，即视为您已确知并完全同意本协议各项内容。
          3、有权根据国家法律法规的更新、产品和服务规则的调整需要不时地制订、修改本协议及/或各类规则，并以网站公示的方式进行公示。如您继续使用平台服务的，即表示您接受经修订的协议和规则。如发生有关争议时，以最新的相关协议和规则为准。
          为维护网民和相关权利人利益，上海瑞家信息技术有限公司已经以公示的方式，为用户及相关权利人提供了丰富、便捷的线上线下投诉渠道。基于网络用户间的公平考量，同时也为了使网络用户的投诉能够及时得到处理，避免被当做垃圾邮件屏蔽，上海瑞家信息技术有限公司拒绝接收和处理所有以电子邮件形式发送给本公司员工个人的网络侵权通知，更不承诺对发送给本公司员工个人的电子邮件侵权通知进行优先处理，特此告知！
        </div>
      </div>
    );
  }
}

export default Protocol;
